lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE4.svd
        <!-- KEY -->
        <register>
          <name>KEY</name>
          <description>Unlock block register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #RST -->
    <!-- RST_CLOCK -->
    <peripheral>
      <name>MDR_RST_CLOCK</name>
      <version>1.0</version>
      <description>CLock Control</description>
      <groupName>RST_CLK</groupName>
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!-- #RST_SIZE -->
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CLOCK STATUS -->
        <register>
          <name>CLOCK_STATUS</name>
          <description>Clock Status Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_STAT_RMASK -->
          <resetMask>0x00000006</resetMask>
          <fields>      
            <!-- #RST_USBPLL_RDY -->
            <field>
              <name>PLL_CPU_RDY</name>
              <description>PLL CPU ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__STATUS__PLL_CPU_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>PLL not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>PLL ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_RDY</name>
              <description>HSE generator ready</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__STATUS__HSE_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>HSE not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>HSE ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_HSE2_RDY -->
            <!-- #RST_DSP_RDY -->
          </fields>
        </register>
        <!-- PLL CONTROL -->
        <register>
          <name>PLL_CONTROL</name>
          <description>PLL Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_PLL_RMASK -->
          <resetMask>0x0000020C</resetMask>
          <fields>
            <!-- #RST_PLL_USB_ON -->
            <!-- #RST_PLL_USB_PLD -->
            <field>
              <name>PLL_CPU_ON</name>
              <description>PLL CPU Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__CPU_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>PLL Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>PLL On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_CPU_PLD</name>
              <description>PLL CPU Restart</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__CPU_PLD_</headerEnumName>
                <enumeratedValue>
                  <name>RestartOff</name>
                  <description>PLL restart inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DoRestart</name>
                  <description>PLL Do Restart</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_PLL_USB_MUL -->
            <field>
              <name>PLL_CPU_MUL</name>
              <description>PLL CPU Mul, [x1 .. x16]</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__CPU_MUL_</headerEnumName>
                <enumeratedValue><name>x1</name><description>PLL mul x1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>PLL mul x2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x3</name><description>PLL mul x3</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>PLL mul x4</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>x5</name><description>PLL mul x5</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>x6</name><description>PLL mul x6</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>x7</name><description>PLL mul x7</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>PLL mul x8</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>x9</name><description>PLL mul x9</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>x10</name><description>PLL mul x10</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>x11</name><description>PLL mul x11</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>x12</name><description>PLL mul x12</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>x13</name><description>PLL mul x13</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>x14</name><description>PLL mul x14</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>x15</name><description>PLL mul x15</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>x16</name><description>PLL mul x16</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_PLL_DSP_VC1 -->
            <!-- CONTROL fields end-->
          </fields>
        </register>
