lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE4.svd
        <!-- RLR -->
        <register>
          <name>RLR</name>
          <description>Reload Period Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <!--PRL-->
            <field>
              <name>PRL</name>
              <description>Timer Period Value</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>  
        </register>
        <!-- SR -->
        <register>
          <name>SR</name>
          <description>Status Regster</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <!--PVU-->
            <field>
              <name>PVU</name>
              <description>PR busy</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_IWDT_PVU__</headerEnumName>
                <enumeratedValue><name>Ready</name><description>PR ready for write</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Busy</name><description>PR busy</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <!--RVU-->
            <field>
              <name>RVU</name>
              <description>PRL busy</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_IWDT_RVU__</headerEnumName>
                <enumeratedValue><name>Ready</name><description>PRL ready for write</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Busy</name><description>PRL busy</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>  
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #ADC -->
    <!-- ADC -->
    <peripheral>
      <name>MDR_ADC</name>
      <version>2.0</version>
      <description>Successive Approximation ADC</description>
      <groupName>ADC</groupName>
      <!-- #ADC_ADDR -->
      <baseAddress>0x40040000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!-- #ADC_SIZE -->
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- ADC1_Cfg -->
        <register>
          <name>ADC1_Cfg</name>
          <description>ADC1 config register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ADC1_RMASK -->
          <resetMask>0x0E1EFFFF</resetMask>
          <fields>
            <field>
              <name>ADON</name>
              <description>Enable ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GO</name>
              <description>Start single ADC mesurement</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Autoclear to zero after start</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Start</name>
                  <description>Start measurement</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKS</name>
              <description>Select Clock</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU_Clock</name>
                  <description>CPU_Clock used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_Clock</name>
                  <description>ADC_Clock used</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE</name>
              <description>Single or Continuous measurement</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Single</name>
                  <description>Single measurement by GO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Continuouse</name>
                  <description>Continuous measurement, until stop by ADON</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHS</name>
              <description>Active channel select</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <!-- #ADC1_CHS -->
                <enumeratedValue><name>Channel_0_RefN</name><description>Signal on PC4, Ref-</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Channel_1_RefP</name><description>Signal on PC3, Ref+</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Channel_2</name><description>Signal on PC2</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Channel_3</name><description>Signal on PC1</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Channel_4</name><description>Signal on PB9</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Channel_5</name><description>Signal on PB8</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Channel_6</name><description>Signal on PB7</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Channel_7</name><description>Signal on PB6</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>TS_VRef_1.23</name><description>Signal from Thermosensor</description><value>30</value></enumeratedValue>
                <enumeratedValue><name>TS_Temperature</name><description>Signal from Thermosensor</description><value>31</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHCH</name>
              <description>Channel switching enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Measure only CHS channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Measure channels selected in reg CHSEL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RGNC</name>
              <description>Signal limiters enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Flag STATUSx.AWOIFEN inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Flag STATUSx.AWOIFEN enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_REF</name>
              <description>Signal amplitude reference</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Internal</name>
                  <description>Signal in [GND..AUcc]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>External</name>
                  <description>Signal in [ADC_Ref-..ADC_Ref+]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV_CLK</name>
              <description>Divider for CPU_Clock usage</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>div_1</name><description>CLK = CPU_CLK</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div_2</name><description>CLK = CPU_CLK/2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div_4</name><description>CLK = CPU_CLK/4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div_8</name><description>CLK = CPU_CLK/8</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div_16</name><description>CLK = CPU_CLK/16</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div_32</name><description>CLK = CPU_CLK/32</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div_64</name><description>CLK = CPU_CLK/64</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div_128</name><description>CLK = CPU_CLK/128</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>div_256</name><description>CLK = CPU_CLK/256</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>div_512</name><description>CLK = CPU_CLK/512</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>div_1024</name><description>CLK = CPU_CLK/1024</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>div_2048</name><description>CLK = CPU_CLK/2048</description><value>11</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ADC_SYNC_CONV -->        
            <field>
              <name>TS_EN</name>
              <description>Thermosensor enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Thermosensor power off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Thermosensor power on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TS_BUFF_EN</name>
              <description>Thermosensor buffer enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Thermosensor buffer disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Thermosensor buffer enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_TS</name>
              <description>Output temperature from Thermosensor</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Channel 31 signal is undefined</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Channel 31 signal is temperature</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_VREF</name>
              <description>Output Vref=1.23 from Thermosensor</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Channel 30 signal is undefined</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Channel 30 signal is VRef</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ADC_TR -->
            <field>
              <name>Delay_GO</name>
              <description>Delay after channels switching in CPU_CLK</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
              <!-- #ADC_DELAY_GO -->
              <enumeratedValues>
                <enumeratedValue><name>1</name><description>1 period of CPU_CLK</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>2</name><description>2 periods of CPU_CLK</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>3</name><description>3 periods of CPU_CLK</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>4</name><description>4 periods of CPU_CLK</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>5</name><description>5 periods of CPU_CLK</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>6</name><description>6 periods of CPU_CLK</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>7</name><description>7 periods of CPU_CLK</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>8</name><description>8 periods of CPU_CLK</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ADC_DELAY_ADC -->
            <!--Fields end-->
          </fields>
        </register>
        <!-- ADC2_Cfg -->
        <register>
          <name>ADC2_Cfg</name>
          <description>ADC2 config register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ADC2_RMASK -->
          <resetMask>0x00020000</resetMask>
          <fields>
            <!-- #ADC2_CFG_VE9x_start -->
            <field>
              <name>ADC1_OP</name>
              <description>ADC1 Setpoint Vref source</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Own</name>
                  <description>Own setpoint Vref</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Thermosensor</name>
                  <description>Setpoint Vref from Thermosensor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ADC2_CFG_VE9x_end -->
          </fields>
        </register>
        <!-- ADC1_H_Level -->
        <register>
          <name>ADC1_H_Level</name>
          <description>ADC High limit</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>Level</name>
              <description>Signal limit level</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>        
          </fields>
        </register>      
        <!-- #ADC2_H_LIM -->
        <!-- ADC1_L_Level -->
        <register derivedFrom="ADC1_H_Level">
          <name>ADC1_L_Level</name>
          <description>ADC Low limit</description>
          <addressOffset>0x00000010</addressOffset>
        </register>
        <!-- #ADC2_L_LIM -->
        <!-- ADC1_Result -->
        <register>
          <name>ADC1_RESULT</name>
          <description>ADC result register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0FFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Channel signal value</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>Channel</name>
              <description>Channel index</description>
              <bitRange>[20:16]</bitRange>
              <enumeratedValues>
                <!-- #ADC1_CHS -->
                <enumeratedValue><name>Channel_0_RefN</name><description>Signal on PC4, Ref-</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Channel_1_RefP</name><description>Signal on PC3, Ref+</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Channel_2</name><description>Signal on PC2</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Channel_3</name><description>Signal on PC1</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Channel_4</name><description>Signal on PB9</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Channel_5</name><description>Signal on PB8</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Channel_6</name><description>Signal on PB7</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Channel_7</name><description>Signal on PB6</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>TS_VRef_1.23</name><description>Signal from Thermosensor</description><value>30</value></enumeratedValue>
                <enumeratedValue><name>TS_Temperature</name><description>Signal from Thermosensor</description><value>31</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- #ADC2_Result -->
        <!-- ADC1_Status -->
        <register>
          <name>ADC1_STATUS</name>
          <description>ADC status register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>Overwrite</name>
              <description>Result overwritten flag</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>No overwritten occure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Overwrite</name>
                  <description>Result overwritten</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWOIFEN</name>
              <description>Signal is out of limiters range</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRange</name>
                  <description>Signal in range</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OutOfRange</name>
                  <description>Signal is out of range</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOCIF</name>
              <description>Result ready to read</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoResult</name>
                  <description>Result is not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Signal is ready to read</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWOIF_IE</name>
              <description>Enable IRQ by AWOIFEN flag</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>IRQ Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>IRQ Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="AWOIF_IE">
              <name>EOCIF_EN</name>
              <description>Enable IRQ by EOCIF flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>    
