lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE4.svd
        <!-- REG_0F -->
        <register>
          <name>REG_0F</name>
          <description>REG_OF Control register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFBFFF</resetMask>
          <fields>
            <!--LSE_ON-->
            <field>
              <name>LSE_ON</name>
              <description>LSE generator enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RTC__LSE_ON_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Disable state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Enable state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--LSE_BYP-->
            <field>
              <name>LSE_BYP</name>
              <description>LSE generator </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RTC__LSE_BYP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Use for external resonator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Use for external generator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--RTC_SEL-->
            <field>
              <name>RTC_SEL</name>
              <description>Select Clock for RTC</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>RTC use LSI clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>RTC use LSE clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSIRTC</name>
                  <description>RTC use HSIRTC clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSERTC</name>
                  <description>RTC use HSERTC clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>                            
            </field>
            <!--RTC_EN-->
            <field derivedFrom="LSE_ON">
              <name>RTC_EN</name>
              <description>RTC enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!--RTC_CAL-->
            <field>
              <name>RTC_CAL</name>
              <description>RTC calibration</description>
              <bitRange>[12:5]</bitRange>              
            </field>
            <!--RTC_CAL-->
            <field>
              <name>LSE_RDY</name>
              <description>LSE frequency ready</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>No frequency or unstable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Frequency ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field> 
            <!--LSI_ON-->
            <field derivedFrom="LSE_ON">
              <name>LSI_ON</name>
              <description>LSI generator enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <!--LSI_TRIM-->
            <field>
              <name>LSI_TRIM</name>
              <description>LSI frequency adjust</description>
              <bitRange>[20:16]</bitRange>              
              <enumeratedValues>
                <enumeratedValue> 
                  <name>69KHz</name>
                  <description>LSI frequency tuner</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>65KHz</name><value>1</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>60KHz</name><value>2</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>58KHz</name><value>3</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>52KHz</name><value>4</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>50KHz</name><value>5</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>49KHz</name><value>6</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>45KHz</name><value>7</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>44KHz</name><value>8</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>42KHz</name><value>9</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>40KHz</name><value>10</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>39KHz</name><value>11</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>37KHz</name><value>12</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>36KHz</name><value>13</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>35KHz</name><value>14</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>33KHz</name><value>15</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>32KHz</name><value>16</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--LSI_RDY-->
            <field derivedFrom="LSE_RDY">
              <name>LSI_RDY</name>
              <description>LSI frequency ready</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <!--HSI_ON-->
            <field derivedFrom="LSE_ON">
              <name>HSI_ON</name>
              <description>HSI generator enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <!--HSI_RDY-->
            <field derivedFrom="LSE_RDY">
              <name>HSI_RDY</name>
              <description>HSI frequency ready</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <!--HSI_TRIM-->
            <field>
              <name>HSI_TRIM</name>
              <description>HSI frequency adjust</description>
              <bitRange>[29:24]</bitRange>              
            </field>
            <!--Standby-->
            <field>
              <name>Standby</name>
              <description>Standby sleep mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Normal mode, DUcc is On</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Standby mode, DUcc is Off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--RTC_RESET-->
            <field>
              <name>RTC_RESET</name>
              <description>Reset RTC bit</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>RTC active state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>RTC in Reset state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- RTC_CNT -->
        <register>
          <name>RTC_CNT</name>
          <description>Count periods of PRL</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- RTC_DIV -->
        <register>
          <name>RTC_DIV</name>
          <description>Counts RTC Clock to get PRL value</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <!--Value-->
            <field>
              <name>Value</name>
              <description>RTC DIV value </description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- RTC_PRL -->
        <register>
          <name>RTC_PRL</name>
          <description>Period value for DIV counter</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <!--Value-->
            <field>
              <name>Value</name>
              <description>RTC PRL value </description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- RTC_ALRM -->
        <register>
          <name>RTC_ALRM</name>
          <description>Event value for CNT counter</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <!--Value-->
            <field>
              <name>Value</name>
              <description>Alarm value of CNT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- RTC_CS -->
        <register>
          <name>RTC_CS</name>
          <description>RTC Control and Status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <!--OWF-->
            <field>
              <name>OWF</name>
              <description>CNT Overflow flag, clear by set 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>No Event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--SECF-->
            <field derivedFrom="OWF">
              <name>SECF</name>
              <description>DIV == PRL Event, clear by set 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <!--ALRF-->
            <field derivedFrom="OWF">
              <name>ALRF</name>
              <description>CNT == ALRM Event, clear by set 1</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <!--OWF_IE-->
            <field derivedFrom="OWF">
              <name>OWF_IE</name>
              <description>Enable IRQ by OWF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <!--SECF_IE-->
            <field derivedFrom="OWF">
              <name>SECF_IE</name>
              <description>Enable IRQ by SECF</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!--ALRF_IE-->
            <field derivedFrom="OWF">
              <name>ALRF_IE</name>
              <description>Enable IRQ by ALRF</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <!--WEC-->
            <field>
              <name>WEC</name>
              <description>RTC Busy flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Registers available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Registers unavailable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #ADCUI -->
    <peripheral>
      <name>MDR_ADCUI</name>
      <version>2.0</version>
      <description>Energy Counter Block</description>
      <groupName>ADCUI</groupName>
      <baseAddress>0x40068000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CTRL1 -->
        <register>
          <name>CTRL1</name>
          <description>ADCUI Control1 Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>ADC1_EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="ADC1_EN"><name>ADC2_EN</name><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="ADC1_EN"><name>ADC3_EN</name><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="ADC1_EN"><name>ADC4_EN</name><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="ADC1_EN"><name>ADC5_EN</name><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="ADC1_EN"><name>ADC6_EN</name><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="ADC1_EN"><name>ADC7_EN</name><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="ADC1_EN"><name>ADC8_EN</name><bitRange>[7:7]</bitRange></field>
            <field>
              <name>REF_EX</name>
              <description>Select VRef</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Internal</name><description>Internal 1.2V</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>External</name><description>External 1.2V from pin VR_1V</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHP1_EN</name>
              <description>Exclude constant component</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ConstOn</name><description>With const level</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ConstOff</name><description>Exclute const level</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CHP1_EN"><name>CHP2_EN</name><bitRange>[10:10]</bitRange></field>        
            <field derivedFrom="CHP1_EN"><name>CHP3_EN</name><bitRange>[11:11]</bitRange></field>        
            <field derivedFrom="CHP1_EN"><name>CHP4_EN</name><bitRange>[12:12]</bitRange></field>        
            <field derivedFrom="CHP1_EN"><name>CHP5_EN</name><bitRange>[13:13]</bitRange></field>        
            <field derivedFrom="CHP1_EN"><name>CHP6_EN</name><bitRange>[14:14]</bitRange></field>        
            <field derivedFrom="CHP1_EN"><name>CHP7_EN</name><bitRange>[15:15]</bitRange></field>        
            <field derivedFrom="CHP1_EN"><name>CHP8_EN</name><bitRange>[16:16]</bitRange></field>
          </fields>
        </register>
        <!-- ANGAIN -->
        <register>
          <name>ANGAIN</name>
          <description>Analog Amplifier Control</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>ADC1_PGA</name>
              <description>Gain Select</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>Gain 0dB</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>Gain 12dB</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Gain 6dB</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x16</name><description>Gain 24dB</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="ADC1_PGA"><name>ADC2_PGA</name><bitRange>[3:2]</bitRange></field>
            <field derivedFrom="ADC1_PGA"><name>ADC3_PGA</name><bitRange>[5:4]</bitRange></field>
            <field derivedFrom="ADC1_PGA"><name>ADC4_PGA</name><bitRange>[7:6]</bitRange></field>
            <field derivedFrom="ADC1_PGA"><name>ADC5_PGA</name><bitRange>[9:8]</bitRange></field>
            <field derivedFrom="ADC1_PGA"><name>ADC6_PGA</name><bitRange>[11:10]</bitRange></field>
            <field derivedFrom="ADC1_PGA"><name>ADC7_PGA</name><bitRange>[13:12]</bitRange></field>
            <field derivedFrom="ADC1_PGA"><name>ADC8_PGA</name><bitRange>[16:14]</bitRange></field>
          </fields>
        </register>
        <!-- DIGGAIN -->
        <register>
          <name>DIGGAIN</name>
          <description>Digital Amplifier Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000002A</resetValue>
          <resetMask>0x0000002A</resetMask>
        </register>  
