lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE4.svd
        <!-- DMAEN -->
        <register>
          <name>DMAEN</name>
          <description>DMA Request Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DMA1_EN</name>
              <description>DMA Request Enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="DMA1_EN"><name>DMA2_EN</name><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="DMA1_EN"><name>DMA3_EN</name><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="DMA1_EN"><name>DMA4_EN</name><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="DMA1_EN"><name>DMA5_EN</name><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="DMA1_EN"><name>DMA6_EN</name><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="DMA1_EN"><name>DMA7_EN</name><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="DMA1_EN"><name>DMA8_EN</name><bitRange>[7:7]</bitRange></field>
          </fields>
        </register>
        <!-- CTRL2 -->
        <register>
          <name>CTRL2</name>
          <description>ADCUI Control2 Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>SFF</name>
              <description>Sinc Filter Fine correction</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SFC</name>
              <description>Sinc Filter Rough correction</description>
              <bitRange>[9:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>cor_0</name><description>Correction</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>cor_1</name><description>Correction</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>cor_2</name><description>Correction</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>cor_3</name><description>Correction</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>cor_4</name><description>Correction</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>cor_5</name><description>Correction</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>cor_6</name><description>Correction</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>cor_7</name><description>Correction</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reset</name>
              <description>Digital part reset</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Working</name><description>Working state</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>DigInReset</name><description>Digital control in reset</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BF_bp</name>
              <description>Avoid Vref buffer</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>BuffOn</name><description>Buffer used</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ByPass</name><description>Buffer by pass</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHOP_Freq</name>
              <description>Chopper frequency</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Invalid_0</name><description>Invalid value</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Invalid_1</name><description>Invalid value</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Invalid_2</name><description>Invalid value</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Ok</name><description>Default value</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- INTEN -->
        <register>
          <name>INTEN</name>
          <description>Irq Enable Control</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>NS1_EN</name>
              <description>IRQ by ADC ready</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="NS1_EN"><name>NS2_EN</name><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="NS1_EN"><name>NS3_EN</name><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="NS1_EN"><name>NS4_EN</name><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="NS1_EN"><name>NS5_EN</name><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="NS1_EN"><name>NS6_EN</name><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="NS1_EN"><name>NS7_EN</name><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="NS1_EN"><name>NS8_EN</name><bitRange>[7:7]</bitRange></field>
            <field>
              <name>OV1_EN</name>
              <description>IRQ by Override ready</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="OV1_EN"><name>OV2_EN</name><bitRange>[9:9]</bitRange></field>
            <field derivedFrom="OV1_EN"><name>OV3_EN</name><bitRange>[10:10]</bitRange></field>
            <field derivedFrom="OV1_EN"><name>OV4_EN</name><bitRange>[11:11]</bitRange></field>
            <field derivedFrom="OV1_EN"><name>OV5_EN</name><bitRange>[12:12]</bitRange></field>
            <field derivedFrom="OV1_EN"><name>OV6_EN</name><bitRange>[13:13]</bitRange></field>
            <field derivedFrom="OV1_EN"><name>OV7_EN</name><bitRange>[14:14]</bitRange></field>
            <field derivedFrom="OV1_EN"><name>OV8_EN</name><bitRange>[15:15]</bitRange></field>        
          </fields>      
        </register>
