lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE4.svd
        <!-- STAT -->
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>NS1</name>
              <description>ADC ready event</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="NS1"><name>NS2</name><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="NS1"><name>NS3</name><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="NS1"><name>NS4</name><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="NS1"><name>NS5</name><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="NS1"><name>NS6</name><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="NS1"><name>NS7</name><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="NS1"><name>NS8</name><bitRange>[7:7]</bitRange></field>
            <field>
              <name>OV1</name>
              <description>FIFO Override event</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="OV1"><name>OV2</name><bitRange>[9:9]</bitRange></field>
            <field derivedFrom="OV1"><name>OV3</name><bitRange>[10:10]</bitRange></field>
            <field derivedFrom="OV1"><name>OV4</name><bitRange>[11:11]</bitRange></field>
            <field derivedFrom="OV1"><name>OV5</name><bitRange>[12:12]</bitRange></field>
            <field derivedFrom="OV1"><name>OV6</name><bitRange>[13:13]</bitRange></field>
            <field derivedFrom="OV1"><name>OV7</name><bitRange>[14:14]</bitRange></field>
            <field derivedFrom="OV1"><name>OV8</name><bitRange>[15:15]</bitRange></field>        
          </fields>      
        </register>
        <!-- ADCx_DAT -->
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8</dimIndex>
          <name>ADC%s_DAT</name>
          <description>ADC FIFO read</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
        </register>
        <!-- TST -->
        <register>
          <name>TST</name>
          <description>Test register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000002</resetMask>
          <fields>
            <field>
              <name>TST2</name>
              <description>Vref to pin VR_1V</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Invalid</name><description>Invalid Value</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Connected</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>   
          </fields>      
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #CRC -->
    <!-- CRC_VE4 -->
    <peripheral>
      <name>MDR_CRC_VE4</name>
      <version>1.0</version>
      <description>CRC Controler</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40098000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CTRL -->
        <register>
          <name>CTRL</name>
          <description>Control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CRCEn</name>
              <description>Enable block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Block inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Block active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DataInv</name>
              <description>Bit first selection</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>LSB</name><description>Low bit first</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>MSB</name><description>High bit first</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_En</name>
              <description>DMA Enable</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DL_Size</name>
              <description>Loading data size</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Byte</name><description>Byte data stream</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>16_bit</name><description>16-bit data stream</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>32_bit</name><description>32-bit data stream</description><value>2</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_Size</name>
              <description>Calculating data size</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Byte</name><description>Byte data word</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>16_bit</name><description>16-bit data word</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>32_bit</name><description>32-bit data word</description><value>2</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>  
        </register>
