lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE4.svd
        <!-- STAT -->
        <register>
          <name>STAT</name>
          <description>Status register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>ConvComp</name>
              <description>Convertion Completed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Processing</name><description>Calculation processing</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Completed</name><description>Calculation completed</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO_Full</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Flag Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Flag Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="FIFO_Full">
              <name>FIFO_Empty</name>
              <description>FIFO Empty</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="FIFO_Full">
              <name>FIFO_Over</name>
              <description>FIFO Over</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>  
        </register>
        <!-- DATAI -->
        <register>
          <name>DATAI</name>
          <description>FIFO Input</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Data Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>  
        </register>
        <!-- CRC_VAL -->
        <register>
          <name>CRC_VAL</name>
          <description>CRC result</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>CRC_Out</name>
              <description>Result and Start Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>  
        </register>
        <!-- CRC_POL -->
        <register>
          <name>CRC_POL</name>
          <description>CRC Polinom select</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>CRC_POL</name>
              <description>Select polinom bits</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>  
        </register>    
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>

    <!-- #UARTs -->
    <!--UART1-->
    <peripheral>
      <name>MDR_UART1</name>
      <version>1.0</version>
      <description>UART Control</description>
      <groupName>UART</groupName>
      <!-- #UART1_ADDR -->
      <baseAddress>0x40008000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--DR-->
        <register>
          <name>DR</name>
          <description>Data Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data FIFO access</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FE</name>
              <description>Stop Bit Error</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Ok</name><description>No Error</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ERROR</name><description>Error is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="FE">
              <name>PE</name>
              <description>Parity Error</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>BE</name>
              <description>Break Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>OE</name>
              <description>Overrun FIFO_RX</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <!--RSR_ECR-->
        <register>
          <name>RSR_ECR</name>
          <description>Receive Status and Error Clear Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>FE</name>
              <description>Stop Bit Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Ok</name><description>No Error</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ERROR</name><description>Error is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="FE">
              <name>PE</name>
              <description>Parity Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>BE</name>
              <description>Break Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>OE</name>
              <description>Overrun FIFO_RX</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <!--FR-->
        <register>
          <name>FR</name>
          <description>Flag Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>CTS</name>
              <description>Modem Clear To Send</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Modem line is High</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Active</name><description>Modem line is Low</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="CTS">
              <name>DSR</name>
              <description>Modem Data Set Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="CTS">
              <name>DCD</name>
              <description>Modem Data Carrier Detect</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>Transmitting data</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFE</name>
              <description>FIFO_RX Empty status</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>FIFO not Empty</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Empty</name><description>FIFO Empty</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFF</name>
              <description>FIFO_TX Full Status</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>FIFO not Full</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Full</name><description>FIFO Full</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="TXFF">
              <name>RXFF</name>
              <description>FIFO_RX Full Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RXFE">
              <name>TXFE</name>
              <description>FIFO_RX Empty status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="CTS">
              <name>RI</name>
              <description>Modem Ring Indicator</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <!--ILPR-->
        <register>
          <name>ILPR</name>
          <description>IrDA Low-Power Counter</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DVSR</name>
              <description>Div of SampleRate</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IBRD-->
        <register>
          <name>IBRD</name>
          <description>Integer BaudRate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>Baud_DivInt</name>
              <description>Integer part of Rate divisor</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
